[
  {
    "role": "Frontend and Workflow Lead",
    "company": "LPS Health",
    "location": "Chicago, IL",
    "duration": "May 2025 – Present",
    "highlights": [
      "Led full redesign and redevelopment of LPS Health’s website to match brand guidelines and improve engagement.",
      "Enhanced accessibility and mobile responsiveness across all pages.",
      "Optimized performance using Lighthouse, SEO strategies, and supported Google Ads visibility.",
      "Contributed to content strategy for social media and wellness campaigns.",
      "Streamlined internal documentation and workflow for smoother team coordination."
    ],
    "tools": ["HTML", "CSS", "WordPress", "Figma", "Lighthouse", "Google Analytics", "SEO tools"]
  },
  {
    "role": "Cloud Analyst",
    "company": "Oracle",
    "location": "Bengaluru, Karnataka, India",
    "duration": "Aug 2022 – Jun 2024",
    "highlights": [
      "Built Redwood-style UIs using Visual Builder Studio for Oracle’s internal BHE Services dashboard.",
      "Created reusable UI components and integrated REST APIs, reducing dev time by 30%.",
      "Resolved over 100 bugs pre-release, reducing post-release issues by 40%.",
      "Worked cross-functionally in Agile sprints to deliver cloud application features.",
      "Contributed to both BHE Services and BHE-HCM projects, earning an Employee Recognition Award."
    ],
    "tools": ["VBS", "JavaScript", "HTML", "CSS", "REST APIs", "JIRA"]
  },
  {
    "role": "Software Engineer Intern",
    "company": "Softora Technologies",
    "location": "Bengaluru, Karnataka, India",
    "duration": "Aug 2021 – Sep 2021",
    "highlights": [
      "Built dashboards and forms for internal portals using JavaScript and Node.js with Express.",
      "Redesigned homepage UI in Figma and implemented it using modern CSS (Flexbox, Grid).",
      "Integrated REST APIs to streamline data flow and improve frontend-backend communication."
    ],
    "tools": ["JavaScript", "HTML", "CSS", "Node.js", "Express", "Figma", "REST APIs"]
  }
]